Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/atdf/ATSAME54N19A.atdf
        <register name="INTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="EXTINT" caption="External Interrupt Enable" mask="0xFFFF"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="EXTINT" caption="External Interrupt" mask="0xFFFF"/>
        </register>
        <register name="ASYNCH" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="External Interrupt Asynchronous Mode">
          <bitfield name="ASYNCH" caption="Asynchronous Edge Detection Mode" mask="0xFFFF" values="EIC_ASYNCH__ASYNCH"/>
        </register>
        <register name="CONFIG" offset="0x1C" rw="RW" size="4" count="2" initval="0x00000000" caption="External Interrupt Sense Configuration">
          <bitfield name="SENSE0" caption="Input Sense Configuration 0" mask="0x7" values="EIC_CONFIG__SENSE0"/>
          <bitfield name="FILTEN0" caption="Filter Enable 0" mask="0x8"/>
          <bitfield name="SENSE1" caption="Input Sense Configuration 1" mask="0x70" values="EIC_CONFIG__SENSE1"/>
          <bitfield name="FILTEN1" caption="Filter Enable 1" mask="0x80"/>
          <bitfield name="SENSE2" caption="Input Sense Configuration 2" mask="0x700" values="EIC_CONFIG__SENSE2"/>
          <bitfield name="FILTEN2" caption="Filter Enable 2" mask="0x800"/>
          <bitfield name="SENSE3" caption="Input Sense Configuration 3" mask="0x7000" values="EIC_CONFIG__SENSE3"/>
          <bitfield name="FILTEN3" caption="Filter Enable 3" mask="0x8000"/>
          <bitfield name="SENSE4" caption="Input Sense Configuration 4" mask="0x70000" values="EIC_CONFIG__SENSE4"/>
          <bitfield name="FILTEN4" caption="Filter Enable 4" mask="0x80000"/>
          <bitfield name="SENSE5" caption="Input Sense Configuration 5" mask="0x700000" values="EIC_CONFIG__SENSE5"/>
          <bitfield name="FILTEN5" caption="Filter Enable 5" mask="0x800000"/>
          <bitfield name="SENSE6" caption="Input Sense Configuration 6" mask="0x7000000" values="EIC_CONFIG__SENSE6"/>
          <bitfield name="FILTEN6" caption="Filter Enable 6" mask="0x8000000"/>
          <bitfield name="SENSE7" caption="Input Sense Configuration 7" mask="0x70000000" values="EIC_CONFIG__SENSE7"/>
          <bitfield name="FILTEN7" caption="Filter Enable 7" mask="0x80000000"/>
        </register>
        <register name="DEBOUNCEN" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="Debouncer Enable">
          <bitfield name="DEBOUNCEN" caption="Debouncer Enable" mask="0xFFFF"/>
        </register>
        <register name="DPRESCALER" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="Debouncer Prescaler">
          <bitfield name="PRESCALER0" caption="Debouncer Prescaler" mask="0x7" values="EIC_DPRESCALER__PRESCALER0"/>
          <bitfield name="STATES0" caption="Debouncer number of states" mask="0x8" values="EIC_DPRESCALER__STATES0"/>
          <bitfield name="PRESCALER1" caption="Debouncer Prescaler" mask="0x70" values="EIC_DPRESCALER__PRESCALER1"/>
          <bitfield name="STATES1" caption="Debouncer number of states" mask="0x80" values="EIC_DPRESCALER__STATES1"/>
          <bitfield name="TICKON" caption="Pin Sampler frequency selection" mask="0x10000" values="EIC_DPRESCALER__TICKON"/>
        </register>
        <register name="PINSTATE" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Pin State">
          <bitfield name="PINSTATE" caption="Pin State" mask="0xFFFF"/>
        </register>
      </register-group>
      <value-group name="EIC_CTRLA__CKSEL">
        <value name="CLK_GCLK" caption="Clocked by GCLK" value="0"/>
        <value name="CLK_ULP32K" caption="Clocked by ULP32K" value="1"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__PRESCALER0">
        <value name="DIV2" caption="EIC clock divided by 2" value="0"/>
        <value name="DIV4" caption="EIC clock divided by 4" value="1"/>
        <value name="DIV8" caption="EIC clock divided by 8" value="2"/>
        <value name="DIV16" caption="EIC clock divided by 16" value="3"/>
        <value name="DIV32" caption="EIC clock divided by 32" value="4"/>
        <value name="DIV64" caption="EIC clock divided by 64" value="5"/>
        <value name="DIV128" caption="EIC clock divided by 128" value="6"/>
        <value name="DIV256" caption="EIC clock divided by 256" value="7"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__STATES0">
        <value name="LFREQ3" caption="3 low frequency samples" value="0"/>
        <value name="LFREQ7" caption="7 low frequency samples" value="1"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__PRESCALER1">
        <value name="DIV2" caption="EIC clock divided by 2" value="0"/>
        <value name="DIV4" caption="EIC clock divided by 4" value="1"/>
        <value name="DIV8" caption="EIC clock divided by 8" value="2"/>
        <value name="DIV16" caption="EIC clock divided by 16" value="3"/>
        <value name="DIV32" caption="EIC clock divided by 32" value="4"/>
        <value name="DIV64" caption="EIC clock divided by 64" value="5"/>
        <value name="DIV128" caption="EIC clock divided by 128" value="6"/>
        <value name="DIV256" caption="EIC clock divided by 256" value="7"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__STATES1">
        <value name="LFREQ3" caption="3 low frequency samples" value="0"/>
        <value name="LFREQ7" caption="7 low frequency samples" value="1"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__TICKON">
        <value name="CLK_GCLK_EIC" caption="Clocked by GCLK" value="0"/>
        <value name="CLK_LFREQ" caption="Clocked by Low Frequency Clock" value="1"/>
      </value-group>
      <value-group name="EIC_NMICTRL__NMISENSE">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising-edge detection" value="1"/>
        <value name="FALL" caption="Falling-edge detection" value="2"/>
        <value name="BOTH" caption="Both-edges detection" value="3"/>
        <value name="HIGH" caption="High-level detection" value="4"/>
        <value name="LOW" caption="Low-level detection" value="5"/>
      </value-group>
      <value-group name="EIC_NMICTRL__NMIASYNCH">
        <value name="SYNC" caption="Edge detection is clock synchronously operated" value="0"/>
        <value name="ASYNC" caption="Edge detection is clock asynchronously operated" value="1"/>
      </value-group>
      <value-group name="EIC_ASYNCH__ASYNCH">
        <value name="SYNC" caption="Edge detection is clock synchronously operated" value="0"/>
        <value name="ASYNC" caption="Edge detection is clock asynchronously operated" value="1"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE0">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
