Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/atdf/ATSAME54N19A.atdf
        <register name="MASK2" offset="0x44" rw="RW" size="4" access-size="4" caption="Mask Register 2">
          <bitfield name="MASK" caption="" mask="0x1F"/>
        </register>
        <register name="FUNCTION2" offset="0x48" rw="RW" size="4" access-size="4" caption="Function Register 2">
          <bitfield name="FUNCTION" caption="" mask="0xF"/>
          <bitfield name="EMITRANGE" caption="" mask="0x20"/>
          <bitfield name="CYCMATCH" caption="" mask="0x80"/>
          <bitfield name="DATAVMATCH" caption="" mask="0x100"/>
          <bitfield name="LNK1ENA" caption="" mask="0x200"/>
          <bitfield name="DATAVSIZE" caption="" mask="0xC00"/>
          <bitfield name="DATAVADDR0" caption="" mask="0xF000"/>
          <bitfield name="DATAVADDR1" caption="" mask="0xF0000"/>
          <bitfield name="MATCHED" caption="" mask="0x1000000"/>
        </register>
        <register name="COMP3" offset="0x50" rw="RW" size="4" access-size="4" caption="Comparator Register 3">
        </register>
        <register name="MASK3" offset="0x54" rw="RW" size="4" access-size="4" caption="Mask Register 3">
          <bitfield name="MASK" caption="" mask="0x1F"/>
        </register>
        <register name="FUNCTION3" offset="0x58" rw="RW" size="4" access-size="4" caption="Function Register 3">
          <bitfield name="FUNCTION" caption="" mask="0xF"/>
          <bitfield name="EMITRANGE" caption="" mask="0x20"/>
          <bitfield name="CYCMATCH" caption="" mask="0x80"/>
          <bitfield name="DATAVMATCH" caption="" mask="0x100"/>
          <bitfield name="LNK1ENA" caption="" mask="0x200"/>
          <bitfield name="DATAVSIZE" caption="" mask="0xC00"/>
          <bitfield name="DATAVADDR0" caption="" mask="0xF000"/>
          <bitfield name="DATAVADDR1" caption="" mask="0xF0000"/>
          <bitfield name="MATCHED" caption="" mask="0x1000000"/>
        </register>
      </register-group>
    </module>
    <module name="ETM" version="1.0.0" caption="Embedded Trace Macrocell">
      <register-group name="ETM" caption="Embedded Trace Macrocell">
        <register name="CR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000411" caption="ETM Main Control Register">
          <bitfield name="ETMPD" caption="ETM Power Down" mask="0x1"/>
          <bitfield name="PORTSIZE" caption="Port Size bits 2:0" mask="0x70"/>
          <bitfield name="STALL" caption="Stall Processor" mask="0x80"/>
          <bitfield name="BROUT" caption="Branch Output" mask="0x100"/>
          <bitfield name="DBGRQ" caption="Debug Request Control" mask="0x200"/>
          <bitfield name="PROG" caption="ETM Programming" mask="0x400"/>
          <bitfield name="PORTSEL" caption="ETM Port Select" mask="0x800"/>
          <bitfield name="PORTMODE2" caption="Port Mode bit 2" mask="0x2000"/>
          <bitfield name="PORTMODE" caption="Port Mode bits 1:0" mask="0x30000"/>
          <bitfield name="PORTSIZE3" caption="Port Size bit 3" mask="0x200000"/>
          <bitfield name="TSEN" caption="TimeStamp Enable" mask="0x10000000"/>
        </register>
        <register name="CCR" offset="0x4" rw="R" size="4" access-size="4" initval="0x8C802000" caption="ETM Configuration Code Register">
        </register>
        <register name="TRIGGER" offset="0x8" rw="RW" size="4" access-size="4" caption="ETM Trigger Event Register">
        </register>
        <register name="SR" offset="0x10" rw="RW" size="4" access-size="4" caption="ETM Status Register">
        </register>
        <register name="SCR" offset="0x14" rw="R" size="4" access-size="4" atomic-op="clear:SR" initval="0x00020D09" caption="ETM System Configuration Register">
        </register>
        <register name="TEEVR" offset="0x20" rw="RW" size="4" access-size="4" caption="ETM TraceEnable Event Register">
        </register>
        <register name="TECR1" offset="0x24" rw="RW" size="4" access-size="4" caption="ETM TraceEnable Control 1 Register">
        </register>
        <register name="FFLR" offset="0x28" rw="RW" size="4" access-size="4" caption="ETM FIFO Full Level Register">
        </register>
        <register name="CNTRLDVR1" offset="0x140" rw="RW" size="4" access-size="4" caption="ETM Free-running Counter Reload Value">
        </register>
        <register name="SYNCFR" offset="0x1E0" rw="R" size="4" access-size="4" initval="0x00000400" caption="ETM Synchronization Frequency Register">
        </register>
        <register name="IDR" offset="0x1E4" rw="R" size="4" access-size="4" initval="0x4114F250" caption="ETM ID Register">
        </register>
        <register name="CCER" offset="0x1E8" rw="R" size="4" access-size="4" initval="0x18541800" caption="ETM Configuration Code Extension Register">
        </register>
        <register name="TESSEICR" offset="0x1F0" rw="RW" size="4" access-size="4" caption="ETM TraceEnable Start/Stop EmbeddedICE Control Register">
        </register>
        <register name="TSEVT" offset="0x1F8" rw="RW" size="4" access-size="4" caption="ETM TimeStamp Event Register">
        </register>
        <register name="TRACEIDR" offset="0x200" rw="RW" size="4" access-size="4" initval="0x00000000" caption="ETM CoreSight Trace ID Register">
        </register>
        <register name="IDR2" offset="0x208" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM ID Register 2">
        </register>
        <register name="PDSR" offset="0x314" rw="R" size="4" access-size="4" initval="0x00000001" caption="ETM Device Power-Down Status Register">
        </register>
        <register name="ITMISCIN" offset="0xEE0" rw="R" size="4" access-size="4" caption="ETM Integration Test Miscellaneous Inputs">
        </register>
        <register name="ITTRIGOUT" offset="0xEE8" rw="W" size="4" access-size="4" caption="ETM Integration Test Trigger Out">
        </register>
        <register name="ITATBCTR2" offset="0xEF0" rw="R" size="4" access-size="4" caption="ETM Integration Test ATB Control 2">
        </register>
        <register name="ITATBCTR0" offset="0xEF8" rw="W" size="4" access-size="4" caption="ETM Integration Test ATB Control 0">
        </register>
